; ************************************************************************
; CONSTANTS
; ************************************************************************
#define Period		0x19		; Период тонального сигнала 
#define X			FLAG,0		; 1 - пересылка данных
#define Y			FLAG,1		; 1 - запуск АЦП
#define ACT			FLAG,2		; 1 - идет передача
; ************************************************************************
; PORT ASSIGNMENTS
;*************************************************************************
#define	FIRE			PORTC,0x00	; СИД
#define BUTTON			PORTB,0x00	; Кнопка/вход управления
; ************************************************************************
; MEMORY ASSIGNMENTS
; ************************************************************************
	CBLOCK	0x00
W_TEMP:				1		; контейнер для хранения аккумулятора
ST_TEMP:			1		; контейнер для хранения регистра статуса
Count:				1		; регистр паузы
paus:				1		; рабочий регистр
FLAG:				1		; регистр флагов
CH_SUM:				1		; контрольная сумма
BUFFER:				100		; буфер заголовка данных
BUF_L:				1
BUF_H:				1		; буфер данных
	ENDC
